{"format": "graph-model", "generatedBy": "2.0.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}}}}, "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ReadVariableOp", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "934"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul", "op": "Mul", "input": ["StatefulPartitionedCall/ReadVariableOp", "x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/ReadVariableOp", "shape": [934, 512], "dtype": "float32"}]}]}